# Ещё не доделала


import json
x = 0

# это пример таблицы, хотя, вероятно, здесь должны быть указаны только объекты(?), которые пользователь сам заполняет позже с помощью Меню
table_projects = [
    {"название проекта": "Проект",
     "статус": "в работе",
     "задачи": ["Собрать данные", "Определить ЦА", "Разработать концепт"]
     }
]

# Сохранение текущей версиии таблицы в json файл. Должно быть после действий с таблицей
with open("projects.json", "w", encoding="utf-8") as f:
    json.dump(table_projects, f, ensure_ascii=False, indent=2)



while x == 0:
    print(
        "\nМеню:\n"
        "1.Показать проекты\n"
        "2.Создать проект\n"
        "3.Добавить задачу\n"
        "4.Показать задачи в проекте\n"
        "5.Изменение статусов проектов\n"
        "6. Выйти из программы\n"
    )
    selection = int(input("Введите цифру, чтобы выполнить одно из действий: "))
    print("\n")

    if selection == 1:
        for table_project in table_projects:
            print(f"{table_project}")
    
    #elif selection == 2:
        # Скорее всего, для записи данных в таблицу подойдёт append

    elif selection == 6:
        break
    
    else:
        print("Опция отсутствует!")
